Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་སྡང་མེད་པའི་སྙིང་རྗེ་ཆེན་པོའོ། །
en: It is great compassion that knows no anger toward any being.

source: དེ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བསྟི་སྟང་དུ་བྱས་ཀྱང་ཁེངས་པར་མི་འགྱུར།
en: “Even if they were honored by all beings, they would not be elated.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བསྟི་སྟང་དུ་མ་བྱས་ཀྱང་དུད་པར་མི་འགྱུར་རོ། །
en: Even if all beings were to fail to honor them, they would not be depressed.

source: ཁེངས་པ་མེད་པ་དང་དུད་པ་མེད་པ་དེ་ནི་ཤེས་པ་ལས་ངེས་པར་བྱུང་བ་ཡིན་གྱི་ང་རྒྱལ་ལས་ངེས་པར་བྱུང་བ་ནི་མ་ཡིན་ནོ། །
en: That they would neither become elated nor depressed is due to their knowledge, not pride.

source: ཁེངས་པ་མེད་པ་དང་དུད་པ་མེད་པ་དེ་ནི་ཆོས་དང་ལྡན་པ་ཡིན་གྱི་གཏི་མུག་དང་ལྡན་པ་ནི་མ་ཡིན་ནོ། །
en: That they would neither become elated nor depressed means they possess the Dharma, not dullness.

source: ཆོས་ཐམས་ཅད་ཤེས་པ་ལས་ངེས་པར་བྱུང་བས་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའི་ལུས་ཀྱི་ལས་དང་ལྡན་པ་ཡིན།
en: “Because all phenomena arise from consciousness, the wisdom of the bodhisattvas precedes all their physical actions.

source: ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའི་ངག་གི་ལས་དང་ལྡན་པ་ཡིན།
en: Wisdom precedes all their verbal actions.

source: ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའི་ཡིད་ཀྱི་ལས་དང་ལྡན་པ་ཡིན་ཏེ།
en: Wisdom precedes all their mental actions.

source: དེ་ལུས་སམ་ངག་གམ་ཡིད་ཀྱི་ལས་གང་བྱེད་ཀྱང་དེ་དག་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་ངོ་། །
en: Any action they engage in—whether physical, verbal, or mental—is preceded by wisdom and inspired by wisdom.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་ལས་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བ་གང་ཞེ་ན།
en: “What are those physical actions of bodhisattvas that are preceded by wisdom?

source: གང་གཟུགས་ཀྱི་ལས་ཀུན་ཏུ་བསྟན་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་འདུལ་བར་བྱེད་དོ། །
en: They are those bodily actions that are displayed, which ripen and guide beings.

source: སྤྱོད་ལམ་ཇི་ལྟ་བུས་སེམས་ཅན་རྣམས་འདུལ་བར་འགྱུར་བ་དེ་ལྟ་བུ་ཉིད་དུ་དེའི་སྤྱོད་ལམ་ལྷུན་གྱིས་གྲུབ་ཅིང་ཡོངས་སུ་བརྟགས་པ་མེད་པར་ཀུན་ཏུ་གནས་སོ། །
en: They are any such activities that guide others; these activities are spontaneously enacted and require no mental imputation.

source: ལུས་ཀྱི་སྐྱོན་དང་། ལུས་ལ་ཆགས་པ་དང་། ལུས་ཀྱི་འགྱུར་བ་དང་། ལུས་ཀྱི་ཚུལ་འཆོས་པ་དང་། ལུས་ཀྱི་འཁྲུགས་པ་དང་། ལུས་ཀྱི་ཡོངས་སུ་རྟོགས་པ་གང་ཡིན་པ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་དེས་ཡང་དག་པར་བཅོམ་པ་ཡིན་ཏེ
en: Such bodhisattvas overcome all physical flaws, attachments to the body, physical changes, physical posturing, physical disturbances, and concepts about the body.

source: ཤིང་ཏ་ལའི་མགོ་གཅད་པ་བཞིན་དུ་རྩ་བ་ནས་ཆད་ནས་མ་འོངས་པ་ན་མི་སྐྱེ་བའི་ཆོས་ཅན་དུ་འགྱུར་རོ། །
en: Like slicing up a palm tree from the canopy on down to the root, such a body will possess unborn qualities in the future.

source: དེ་ལུས་ཡོངས་སུ་དག་པ་ཡིན་ཏེ་
en: “Such a body is pure.

source: ལུས་མཚན་ཉིད་ཀྱིས་ལེགས་པར་བརྒྱན་པ་དང་།
en: It is well adorned with appropriate defining qualities.

source: ལག་པ་དང་རྐང་པ་འཇམ་ཞིང་མཉེན་པ་དང་།
en: Its hands and feet are soft and pliant.

source: བསོད་ནམས་ཀྱི་རྒྱུ་འཐུན་པའི་ལུས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་དང་།
en: It is a powerful body that accords with the cause of merit.

source: དབང་པོ་མ་ཚང་བ་མེད་པ་དང་།
en: It lacks no faculties.

source: ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་ཡིན་ཡང་གཟུགས་ཀྱིས་རྒྱགས་ཤིང་དྲེགས་པ་མེད་པ་ཡིན་ཏེ
en: All limbs and digits are complete.

source: ལུས་ཆེ་བའི་ཚུལ་དང་ལྡན་པ་མ་ཡིན་ནོ། །
en: It is satisfied with its form but not puffed up;

source: དེ་ཆོས་འཛིན་པ་ཉེ་བར་བཟུང་ནས་སེམས་ཅན་ཇི་ཙམ་དུ་དམན་པ་གཟུགས་མ་ཚང་བ་རྣམས་ལ་ཡང་འདུད་དོ། །རབ་ཏུ་འདུད་དོ། །
en: it is not proud of its greatness. Bearing all such qualities, it still bows to and pays respect to all beings no matter how inferior and flawed their forms may be.

source: དེ་རང་གིས་ལུས་ཀྱི་ཆོས་ཉིད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་དུ་ཤེས་པ་ལ་འཇུག་གོ། །
en: Through the nature of their own bodies, bodhisattvas develop knowledge of the identical nature of all beings’ bodies.

source: དེ་ལུས་ལ་ལུས་ཀྱི་ཆོས་ཉིད་ཤེས་ནས་ཆོས་ཀྱི་ལུས་ཡིན་གྱི་ཟང་ཟིང་གི་ལུས་མ་ཡིན་ནོ། །
en: With regard to the body, knowing its nature it is a Dharma body, not a material body.

source: དེ་ལ་ལུས་ཀྱི་ཆོས་ཉིད་གང་ཞེ་ན།
en: “What is the nature of that body?

source: གང་བསམ་གཏན་གྱི་ཟས་ཟ་བ་ཡིན་ཏེ།
en: It is a body that consumes the food of concentration rather than material food.

source: ཟང་ཟིང་གི་ཟས་ཟ་བ་མ་ཡིན་ཏེ། འཇིག་རྟེན་དང་འཐུན་པར་བྱ་བ་དང་སེམས་ཅན་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་ཟས་ཟའི། ལུས་ཉམ་ཆུང་བའི་ཕྱིར་ནི་མ་ཡིན་ནོ། །
en: It consumes food in order to accord with the world and out of heartfelt care for beings, not because it feels physically weak.

source: དེ་ཆོས་ཀྱི་ལུས་སུ་གྱུར་ནས་ཆོས་ཀྱིས་སྲོག་འཚོའི་ཟང་ཟིང་གིས་སྲོག་འཚོ་བ་ནི་མ་ཡིན་ནོ། །
en: Because it is a Dharma body, it is sustained by the Dharma, not by material substances.

source: དེ་ལ་ཆོས་ཀྱིས་སྲོག་འཚོ་བ་གང་ཞེ་ན།
en: “What does it mean to be sustained by the Dharma?

source: གང་སྲོག་གི་ཕྱིར་ཡང་བྱ་བ་མ་ཡིན་པར་མི་བྱེད་པ་དང་། འཕགས་པའི་ཚུལ་ལས་མི་འདའ་བའོ། །
en: It means to refrain from doing anything unsuitable for the sake of survival and not to violate the way of the noble ones.

source: དེ་ལ་འཕགས་པ་རྣམས་ཀྱི་ཚུལ་གང་ཞེ་ན།
en: What is the way of the noble ones?

source: འདི་ལྟ་སྟེ། ཆགས་པ་མེད་པ་དང་། སྡང་བ་མེད་པ་དང་། རྨོངས་པ་མེད་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་དང་བྲལ་བ་དང་།
en: It is to be without attachment, anger, stupidity, or any afflictive emotions.

source: ཇི་ལྟར་བསླབ་པ་བཅས་པ་བཞིན་དུ་ཀུན་ཏུ་བསྲུང་བ་དང་། སྦེད་པ་དང་རབ་ཏུ་གནས་པ་
en: It is to uphold, care for, and be stable in one’s training.

source: འདི་ནི་འཕགས་པ་རྣམས་ཀྱི་ཚུལ་ཞེས་བྱའོ། །
en: This is the noble way.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའི་ལུས་ཀྱི་ལས་དང་ལྡན་པས་མངོན་པར་ཤེས་པ་དང་། རྫུ་འཕྲུལ་གྱི་སྟོབས་ཐམས་ཅད་དང་ལྡན་པ་ཡིན་ཏེ།
en: “In this manner, because the physical actions of bodhisattvas are preceded by wisdom, they have all the strengths of super-knowledge and miracles.

source: དེ་ལྷུན་གྱིས་གྲུབ་པར་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་སྣང་བར་བྱེད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་སེམས་ཅན་དེ་དག་གི །
en: These bodhisattvas spontaneously illuminate all buddha realms.

source: གཟུགས་དང་མཚན་དང་གཟི་བརྗིད་དང་རྒྱན་རྣམས་ཅི་འདྲ་བར་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཡང་ལྷུན་གྱིས་གྲུབ་ཅིང་ཡོངས་སུ་བརྟགས་པ་མེད་པར་དེ་འདྲ་བར་གནས་སོ། །
en: There, spontaneously and without imputation, they possess the same body, marks, splendor, and ornaments that the beings in those buddha realms possess.

source: དེ་འོད་བཀོད་པའི་ལུས་དང་ལྡན་པ་ཡིན་ཏེ།
en: “They have bodies that shine.

source: དེ་གང་གི་ཚེ་ལུས་ལས་འོད་རབ་ཏུ་གཏོང་བ་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་དཔག་ཏུ་མེད་པ་རྣམས་སྣང་བས་ཁྱབ་པར་བྱེད་དོ། །
en: When their bodies emit light, its radiance fills countless and fathomless buddha realms.

source: དེའི་འོད་དེ་ནི་བདེ་བ་སྐྱེད་པ་སྟེ།
en: This light engenders joy.

source: སེམས་ཅན་དམྱལ་བ་ངན་སོང་བའི་སེམས་ཅན་ཐམས་ཅད་བདེ་བར་བྱེད་པའོ། །
en: It brings pleasure to beings who have gone to the lower realms of the hells.

source: དེའི་འོད་དེ་ནི་བདེ་བ་ལ་རེག་པ་བྱེད་པ་སྟེ།
en: It makes them blissful.

source: ཉོན་མོངས་པས་གདུངས་པའི་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པའོ། །
en: It brings relief to beings who are tormented by the afflictions.

source: དེའི་འོད་དེ་ནི་རབ་ཏུ་སིམ་པར་བྱེད་པ་སྟེ། སེམས་ཅན་རྣམས་ཀྱི་ལུས་དང་སེམས་དགའ་བ་བསྐྱེད་པའོ། །
en: This light satisfies beings and brings them physical and mental joy.

source: དེ་ལུས་ཉིད་ཀྱི་སེམས་ཅན་རྣམས་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་དེ།
en: With their bodies they demonstrate buddha activity for others.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་ལས་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའོ། །
en: This is how the physical actions of bodhisattvas are preceded by wisdom.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ངག་གི་ལས་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བ་གང་ཞེ་ན།
en: “Sāgaramati, what are the bodhisattvas’ verbal actions that are preceded by wisdom?

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཚིག་འཁྲུལ་པའི་སྐྱོན་ཐམས་ཅད་སྤངས་པར་ངག་གི་ལས་འབྱུང་ངོ་། །
en: Sāgaramati, for bodhisattvas their speech occurs while having eliminated all faults of delusory language.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་ཚིག་འཁྲུལ་པའི་སྐྱོན་དེ་དག་གང་ཞེ་ན།
en: Sāgaramati, what are these faults of delusory language?

source: བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཚིག་འཁྲུལ་པའི་སྐྱོན་དྲུག་ཅུ་རྩ་བཞི་དང་བྲལ་ཞིང་རྣམ་པར་སྤངས་པར་ངག་གི་ལས་འབྱུང་སྟེ།
en: Sāgaramati, bodhisattvas are free from sixty-four faults of delusory language and their speech occurs having eliminated them.

source: དྲུག་ཅུ་རྩ་བཞི་གང་ཞེ་ན།
en: What are these sixty-four faults?

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཚིག་རྩུབ་པོ་མེད་པ་ཡིན། ཚིག་རྙོག་པ་མེད་པ་ཡིན། གྱོ་མོའི་སྒྲ་ལྟ་བུ་མེད་པ་ཡིན། གྲུམ་པའི་སྒྲ་ལྟ་བུ་མེད་པ་ཡིན། སྒྲ་ཧ་ཅང་ཆེ་བ་མ་ཡིན། སྒྲ་ཧ་ཅང་ཆུང་བ་མ་ཡིན། སྒྲ་ཧ་ཅང་དྲག་པོ་མ་ཡིན། ཚིག་བརླང་པོ་མེད་པ་ཡིན། ཚིག་དིབ་དིབ་པོ་མེད་པ་ཡིན། ཚིག་ཅལ་ཅལ་པོ་མེད་པ་ཡིན། ཚིག་ཏབ་ཏབ་པོ་མེད་པ་ཡིན། ཁས་བུབ་པའི་ཚིག་ལྟ་བུ་མེད་པ་ཡིན། ཚིག་ཉམས་པ་མེད་པ་ཡིན། ཟུར་དབྱུང་དགོས་པའི་ཚིག་མེད་པ་ཡིན། ཚིག་ཞུམ་པ་མེད་པ་ཡིན། ཚིག་སུབ་སུབ་པོ་མེད་པ་ཡིན། བྱིས་པའི་ཚིག་ལྟ་བུ་མེད་པ་ཡིན། ཚིག་ནོག་ནོག་པོ་མེད་པ་ཡིན། འབར་བར་བྱེད་པའི་ཚིག་མེད་པ་ཡིན། ཅོ་འདྲི་བའི་ཚིག་མེད་པ་ཡིན། དུས་མི་ཤེས་པའི་ཚིག་མེད་པ་ཡིན། ཚོད་མི་ཤེས་པའི་ཚིག་མེད་པ་ཡིན། འདོད་ཆགས་ཀྱིས་རྗེས་སུ་ཆགས་པའི་ཚིག་མེད་པ་ཡིན། ཞེ་སྡང་གིས་ཞེ་འགྲས་པའི་ཚིག་མེད་པ་ཡིན། གཏི་མུག་གིས་རྨོངས་ཤིང་ལྐུགས་པའི་ཚིག་མེད་པ་ཡིན། དམན་པའི་ཚིག་མེད་པ་ཡིན། མི་འཐུན་པ་དང་བརྙས་པའི་ཚིག་མེད་པ་ཡིན། འབྱེད་པར་བྱེད་པའི་ཚིག་མེད་པ་ཡིན། གཡོ་དང་འདྲེས་པའི་ཚིག་མེད་པ་ཡིན། ང་རྒྱལ་གྱིས་ཁེངས་པའི་ཚིག་མེད་པ་ཡིན། ཁྱད་དུ་གསོད་པའི་ཚིག་མེད་པ་ཡིན། ངོ་ཟ་རིང་གི་ཚིག་མེད་པ་ཡིན། ཚིག་མི་སྙན་ཅིང་ཞེར་འདེབས་པའི་ཚིག་མེད་པ་ཡིན། མེད་པས་གླེང་བའི་ཚིག་མེད་པ་ཡིན། འཁྲུལ་ཅིང་གཤེ་བའི་ཚིག་མེད་པ་ཡིན། ཡང་དག་པ་མ་ཡིན་པའི་ཚིག་མེད་པ་ཡིན། འཕྲལ་དུ་བརྫུན་སྨྲ་བའི་ཚིག་མེད་པ་ཡིན། ཕྲ་མའི་ཚིག་མེད་པ་ཡིན། ངག་རྩུབ་པོའི་ཚིག་མེད་པ་ཡིན། ཚིག་ཀྱལ་པའི་ཚིག་མེད་པ་ཡིན། མཛའ་བོ་དང་འབྱེད་པའི་ཚིག་མེད་པ་ཡིན། ཧ་ཅང་རྣོ་བའི་ཚིག་མེད་པ་ཡིན། ཧ་ཅང་མཉེན་པའི་ཚིག་མེད་པ་ཡིན། ཕལ་པའི་ཚིག་མེད་པ་ཡིན། ཀུན་ཏུ་མ་བསྲུངས་པའི་ཚིག་མེད་པ་ཡིན། དུས་ལས་ལྷག་པར་སྨྲ་བའི་ཚིག་མེད་པ་ཡིན། གནོད་སེམས་འབར་བའི་ཚིག་མེད་པ་ཡིན། འཐབ་པ་དང་རྩོད་པ་དང་འགྱེད་པའི་ཚིག་མེད་པ་ཡིན། ཐོབ་ཀྱིས་འཇལ་བའི་ཚིག་མེད་པ་ཡིན། ཚིག་འགྱུར་བ་མེད་པ་ཡིན། ཚིག་མི་བརྟན་པ་མེད་པ་ཡིན། མུ་ཅོར་སྨྲ་བའི་ཚིག་མེད་པ་ཡིན། གར་གྱི་ལྟད་མོའི་ཚིག་ལྟ་བུ་མེད་པ་ཡིན། ཆོས་དང་འགལ་བའི་ཚིག་མེད་པ་ཡིན། གསང་འཕེལ་བའི་ཚིག་མེད་པ་ཡིན། སེམས་ཅན་ལ་གནོད་པའི་ཚིག་མེད་པ་ཡིན། བདག་ལ་སྟོད་པའི་ཚིག་མེད་པ་ཡིན། གཞན་ལ་སྨོད་པའི་ཚིག་མེད་པ་ཡིན། འཕྱ་བ་དང་སྟིང་བའི་ཚིག་མེད་པ་ཡིན། སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་ལ་འགལ་བའི་ཚིག་མེད་པ་ཡིན། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པའི་ཚིག་མེད་པ་ཡིན། ངོ་མི་ཆོད་པའི་ཚིག་མེད་པ་ཡིན།
en: “Sāgaramati, bodhisattvas’ use of language is not harsh, not sullied, not gritty, not gravelly, not too loud, not too soft, not too forceful, not foul, not rushed, not blabbering, not sudden, not mumbling, not unclear, not pointed, not discouraging, not annoying, not childish, not vacillating, not inflaming, not injurious, not untimely, not unmeasured, not covetous due to attachment, not spiteful due to aggression, not dull and stupid due to delusion, not base, not disharmonious and abusive, not divisive, not deceptive, not puffed up, not condescending, not possessive, not displeasing, not hostile, not untrue, not misleading, not scornful, not disingenuous, not suddenly being false, not slanderous, not rude, not gossipy, not divisive among friends, not too sharp, not too gentle, not ordinary, not unguarded, not inappropriate, not inciting malice, not instigating conflict or debate or dispute, not attempting to take over others property, not malleable, not unstable, not secretive, not concerned with entertainment, not contrary to the Dharma, not advertising secrets, not harmful to beings, not praising of oneself, not condemning others, not ridiculing or rebuking others, not contradictory to the Buddha, Dharma, or Saṅgha, not denigrating the noble ones, and not indecisive.

source: ཚིག་འཁྲུལ་པའི་སྐྱོན་ཐམས་ཅད་དང་བྲལ་བའི་ཚིག་ཉིད་ནི་ཚིག་དྲུག་ཅུ་རྩ་བཞི་པ་ཡིན་ཏེ།
en: These are the sixty-four faults of delusory language, of which they are entirely free.

source: བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔའ་ངག་གི་ལས་ནི་ཚིག་འཁྲུལ་པའི་སྐྱོན་དྲུག་ཅུ་རྩ་བཞི་པོ་དེ་དག་དང་བྲལ་ཞིང་ཡོངས་སུ་དག་པར་འབྱུང་ངོ་། །
en: “Sāgaramati, bodhisattvas’ verbal actions are free of and are pure of these sixty-four faults of delusive language.

source: དེའི་ངག་དེ་ནི་ཕྱད་པར་ལུང་སྟོན་པ་དང་། ཡང་དག་པར་ལུང་སྟོན་པ་དང་། དེ་ཁོ་ན་ལུང་སྟོན་པ་དང་།
en: Their speech teaches continuously, genuinely, and truly.

source: བདེན་པ་རྣམ་པར་དགོད་པ་ལུང་སྟོན་པ་དང་། བདེན་པའི་རྗེས་སུ་འབྲང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐད་ལ་འཇུག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ལུང་སྟོན་པ་དང་།
en: It teaches by presenting the truth, being in accord with the truth, using the languages of all beings, and teaching in accord with the outlook of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་སྐུལ་བར་བྱེད་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་པ་དང་། ཆོས་དང་མི་འགལ་བ་དང་། བསོད་ནམས་ཀྱི་རྒྱུ་འཐུན་པ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་དང་། ཟླ་བ་ལྟར་དྲི་མ་མེད་ཅིང་སྙན་པ་དང་། འདོད་ཆགས་ཀུན་ཏུ་སྐྱེད་པ་མ་ཡིན་པ་དང་། ཚར་གཅད་ནས་ཡོན་ཏན་སྨྲ་བ་དང་། ཞེ་སྡང་མི་སྐྱེད་པ་དང་། ཟབ་ཅིང་གཏིང་དཔག་དཀའ་བ་དང་། གཏི་མུག་ཀུན་ཏུ་མི་སྐྱེད་པ་དང་། ཕྱོགས་བཅུར་གོ་བར་བྱེད་ཅིང་རྒྱས་པར་འགེངས་པ་དང་། ཚིག་དོན་མེད་པ་མ་ཡིན་པ་དང་། ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པའི་མཚན་ཉིད་དུ་འབྱུང་སྟེ
en: It satisfies all beings, inspires the faculties of beings, pacifies all afflictive emotions, is blessed by the buddhas, does not contradict the Dharma, accords with the cause of merit, is distinct, is famous and immaculate like the moon, does not arouse attachment, defeats opposition, expresses qualities, does not arouse aggression, is profound and hard to fathom, does not arouse dullness, fills the ten directions and stimulates understanding, is never pointless, engages all topics, and is unconditioned.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ངག་གི་ལས་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའོ། །
en: Sāgaramati, this is how the verbal actions of bodhisattvas are preceded by wisdom.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡིད་ཀྱི་ལས་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བ་གང་ཞེ་ན།
en: “Sāgaramati, how are the mental actions of bodhisattvas preceded by wisdom?

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཀྱི་འཇུག་པ་གཅིག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་དང་གཡོ་བ་རྣམས་རབ་ཏུ་ཤེས་སོ། །
en: Sāgaramati, bodhisattva great beings can understand the mental processes and movements of all beings’ minds through a single mental act of their own.

source: མཉམ་པར་བཞག་ཀྱང་སྤྱོད་ལམ་ཐམས་ཅད་ཀུན་ཏུ་སྟོན་ཅིང་ཏིང་ངེ་འཛིན་དེ་ལས་ལྡང་བའང་མེད་དོ། །
en: While resting in equipoise, they display all forms of conduct, yet do not arise from absorption.

source: དེའི་སེམས་ཀྱི་ལས་ནི་བདུད་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་ཤེས་སོ། །
en: Their mental actions are not known by māras.

source: དེའི་སེམས་ཀྱི་འཇུག་པ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་ཤེས་སོ། །
en: Their mental acts are not comprehensible to hearers or solitary buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་བདག་ལ་གནོད་པར་བྱ་བ་དང་། གཞན་ལ་གནོད་པར་བྱ་བ་དང་། གཉི་ག་ལ་གནོད་པར་བྱ་བ་མི་སེམས་སོ། །
en: Such bodhisattvas do not conceive of anything that would be injurious to themselves, to others, or to both.

source: དེའི་སེམས་དང་ཡིད་དང་རྣམ་པར་ཤེས་པ་ནི་ཆོས་གང་ལ་ཡང་ཐོགས་པ་མེད་དོ། །
en: Their mind, cognition, and consciousness are not obstructed by any phenomenon.

source: དེ་ཆོས་ཐམས་ཅད་རིག་པར་ཡེ་ཤེས་མཐོང་བ་སྐྱེའོ། །
en: They see with a wisdom that is cognizant of all phenomena.

source: སེམས་དང་ཡིད་དང་རྣམ་པར་ཤེས་པ་དེས་རིག་པ་མེད་པར་ཚོར་བ་ཡང་སོ་སོར་མྱོང་ལ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་མ་རྫོགས་ཀྱི་བར་དུ་ཚོར་བ་འགོག་པ་མངོན་སུམ་དུ་ཡང་མི་བྱེད་དེ
en: Their mind, cognition, and consciousness experience feelings free from knowing and they do not manifest the cessation of feelings until the qualities of buddhahood are brought to perfection.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡིད་ཀྱི་ལས་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའོ། །
en: Sāgaramati, this is how the mental actions of bodhisattvas are preceded by wisdom.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ནི་ཤིན་ཏུ་དཀར་བའི་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་དེའི་རྩ་བའི་གནས་ཏེ།
en: “Sāgaramati, this is the fundamental point of the pristine and immaculate absorption seal:

source: འདི་ལྟ་སྟེ། ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའི་ལུས་ཀྱི་ལས་དང་། ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའི་ངག་གི་ལས་དང་། ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའི་ཡིད་ཀྱི་ལས་སོ། །
en: their physical actions are preceded by wisdom, their verbal actions are preceded by wisdom, and their mental actions are preceded by wisdom.

source: བློ་གྲོས་རྒྱ་མཚོ་གང་གི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་རྣམས་དང་ལྡན་པར་གྱུར་པ་དེའི་ཚེ་ཤིན་ཏུ་དཀར་བའི་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་འདི་རབ་ཏུ་འཐོབ་བོ། །
en: Sāgaramati, when bodhisattva great beings engage in physical, verbal, and mental actions that are preceded by wisdom, they attain the pristine and immaculate absorption seal.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་ཆོས་བཅུ་ཤིན་ཏུ་དཀར་བའི་ཕྱིར་ཏིང་ངེ་འཛིན་འདི་ནི་ཤིན་ཏུ་དཀར་བ་ཞེས་བྱ་སྟེ
en: “Sāgaramati, because ten qualities are pristine, this absorption is said to be pristine.

source: ཆོས་བཅུ་པོ་དེ་དག་གང་ཞེ་ན།
en: What are these ten qualities?

source: འདི་ལྟ་སྟེ། བསམ་པ་དང་ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་པས་འཇུག་པའི་སྤྱོད་པ་ཤིན་ཏུ་དཀར་བ་ཡིན།
en: “(1) The actions that they engage in are pristine because their intentions and motivation are pure.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་དག་པས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཤིན་ཏུ་དཀར་བ་ཡིན།
en: (2) Their bodhisattva conduct is pristine because their six perfections are pure.

source: དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་དག་པས་དཀར་པོ་རྣམ་པར་མཐོང་བའི་སྤྱོད་པ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཡིན།
en: (3) Their conduct aimed at goodness is pristine because all their virtuous qualities are pure.

source: གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་བྱེད་པ་ཡོངས་སུ་དག་པས་མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་སྤྱོད་པ་ཤིན་ཏུ་དཀར་བ་ཡིན།
en: (4) Their actions that bring the major and minor marks of perfection to completion are pristine because their unstinting offerings are pure.

source: ཇི་ལྟར་ཐོས་པའི་ཆོས་བསྒྲུབ་ཅིང་གཞན་ལ་གོ་བར་བྱེད་པ་ལ་མཁས་པ་ཡོངས་སུ་དག་པས་གཟུངས་དང་སྤོབས་པ་རབ་ཏུ་འཐོབ་པའི་སྤྱོད་པ་ཤིན་ཏུ་དཀར་བ་ཡིན།
en: (5) Their actions that assure recollection and eloquence are pristine because their skill in accomplishing the teachings just as they hear them, and helping others to understand them, is pure.

source: འཁྲུལ་པ་དང་། སྒྲིབ་པ་དང་ཆོད་པ་དང་ཀུན་ནས་ལྡང་བ་ཐམས་ཅད་དང་བྲལ་བ་ཡོངས་སུ་དག་པས་དྲན་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཡེང་བ་མེད་པའི་ཤེས་པ་ཤིན་ཏུ་དཀར་བ་ཡིན།
en: (6) Their mindfulness, absorption, and undistracted consciousness are pristine because of the way in which they are free from all confusion, obscuration, discontinuity, and ebullience.

source: བག་ཡོད་པ་ཡོངས་སུ་དག་པས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཤེས་པ་ཤིན་ཏུ་དཀར་བ་ཡིན།
en: (7) Their knowledge of the phenomena related to awakening is pristine because their conscientiousness is pure.

source: སེམས་དང་ཡིད་དང་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་དག་པས་ཞི་གནས་དང་ལྷག་མཐོང་ཤེས་པ་ཤིན་ཏུ་དཀར་བ་ཡིན།
en: (8) Their knowledge of tranquility and special insight is pristine because their mind, cognition, and consciousness are pure.

source: ཕྱོགས་དང་མི་འཐུན་པའི་ཕྱོགས་དང་རྒྱུན་ཆད་པ་དང་ཆགས་པ་ལས། ཤིན་ཏུ་འདས་པ་ཡོངས་སུ་དག་པས་ས་བཅུ་གནོན་པའི་ཡེ་ཤེས་ཤིན་ཏུ་དཀར་བ་ཡིན།
en: (9) Their wisdom that arrives at the ten levels is pristine because their transcendence of inappropriate directions, discontinuities, and desire is pure.

source: མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤང་བའི་ཕྱིར་དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་དག་པས་བྱང་ཆུབ་ཀྱི། སྙིང་པོའི་རྒྱན་གྱི་ཡེ་ཤེས་ཤིན་ཏུ་དཀར་བ་ཡིན་ཏེ།
en: (10) Their wisdom that is the ornament of the seat of awakening is pristine because their virtuous qualities are pure through having eliminated all nonvirtuous qualities.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་བཅུ་པོ་དེ་དག་ཤིན་ཏུ་དཀར་བའི་ཕྱིར་ཏིང་ངེ་འཛིན་འདི་ཤིན་ཏུ་དཀར་བ་ཞེས་བྱའོ།། །།
en: Sāgaramati, because these ten qualities are pristine, this absorption is said to be pristine.

source: བློ་གྲོས་རྒྱ་མཚོ་ཅིའི་ཕྱིར་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་ཞེ་ན།
en: “Sāgaramati, why is it called an immaculate seal?

source: བློ་གྲོས་རྒྱ་མཚོ་ཉི་ཤུ་པོ་འདི་དག་ནི་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་སྒོ་ཡིན་ཏེ།
en: These twenty factors are the gateway to this immaculate seal.

source: དེ་དག་གིས་ནི་ཏིང་ངེ་འཛིན་འདི་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་ཞེས་བྱའོ། །
en: It is because of these twenty factors that this absorption is called an immaculate seal.

source: ཉི་ཤུ་པོ་དེ་དག་གང་ཞེ་ན།
en: What are these twenty factors?

source: འདི་ལྟ་སྟེ། ངར་འཛིན་པ་ཡོངས་སུ་དག་པས་ནང་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: “(1) It is the immaculate seal that is inwardly pure because it is purified of self-clinging.

source: ང་ཡིར་འཛིན་པ་ཡོངས་སུ་དག་པས་ཕྱི་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (2) It is the immaculate seal that is outwardly pure because it is purified of clinging to ‘mine.’

source: ལྟ་བར་སོང་བ་ཐམས་ཅད་ཡོངས་སུ་དག་པས་འཇིག་ཚོགས་ཀྱི་ངོ་བོ་ཉིད་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (3) It is the immaculate seal that is purified of the essential nature of the transitory collection because it is purified of all views.

source: གདོད་མ་ནས་ཡོངས་སུ་དག་པའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་བདག་མེད་པ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (4) It is the pure and immaculate seal of the selflessness of all beings because it is primordially pure.

source: རོ་གཅིག་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་རྟོགས་པ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (5) It is the pure and immaculate seal that realizes all phenomena as the same because it is of one taste.

source: རྣམ་པར་ཐར་པ་ཐམས་ཅད་ཡོངས་སུ་དག་པའི་ཕྱིར་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (6) It is the pure and immaculate seal of emptiness, signlessness, and wishlessness because all forms of liberation are pure.

source: ཤིན་ཏུ་ཡོངས་སུ་དག་པའི་ཕྱིར་ནམ་མཁའ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (7) It is the pure and immaculate seal of space because it is completely pure.

source: ཐ་དད་དུ་བྱ་བ་མེད་པའི་ཕྱིར་སེམས་ཅན་གྱི་ཁམས་དང་ཆོས་ཀྱི་དབྱིངས་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (8) It is the pure and immaculate seal of the dispositions of beings and the realm of phenomena because it is nothing that can be separated.

source: རང་གི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པའི་ཕྱིར་མངོན་སུམ་དུ་ལེགས་པར་མཐོང་བ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (9) It is the pure and immaculate seal of clear vision because its super-knowledge is pure.

source: རྟག་ཏུ་སྣང་བ་ཡོངས་སུ་དག་པའི་ཕྱིར་ཉི་མའི་དཀྱིལ་འཁོར་ལྟར་རབ་ཏུ་གསལ་བ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (10) It is the pure and immaculate seal that shines like the sun because its eternal light is pure.

source: ཆགས་པ་ཐམས་ཅད་དང་བྲལ་བ་ཡོངས་སུ་དག་པའི་ཕྱིར་དུས་གསུམ་ལ་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (11) It is the pure and immaculate seal of wisdom that sees the three times without attachment because it is pure in being free of all attachment.

source: རྣམ་པར་ཤེས་པ་དང་ཡེ་ཤེས་གནས་པ་མེད་པའི་ཕྱིར་རྣམ་པར་རིག་པའི་སྒོ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (12) It is the pure and immaculate seal of the gateway to understanding because neither consciousness nor wisdom exists.

source: འདུས་བྱས་ཀྱི་ངོ་བོ་ཉིད་ཡོངས་སུ་དག་པའི་ཕྱིར་འདུས་མ་བྱས་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (13) It is the pure and immaculate seal of the unconditioned because it purifies the essential nature of conditioned phenomena.

source: རྐྱེན་ཤིན་ཏུ་བརྟགས་པའི་ཕྱིར་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྟོགས་པ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (14) It is the pure and immaculate seal that realizes dependent origination because it analyzes conditions.

source: ཡང་དག་པར་ཤེས་པ་རྫི་བ་མེད་པ་ཡོངས་སུ་དག་པའི་ཕྱིར་སྟོབས་དང་མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་རྗེས་སུ་འགྲོ་བ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (15) It is the pure and immaculate seal that follows the strengths , fearlessnesses, and qualities of buddhahood because it is pure, untrammeled knowledge.

source: སྔོན་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡོངས་སུ་དག་པའི་ཕྱིར། སངས་རྒྱས་ཀྱི་ཆོས་རྟོགས་པའི་མཚན་ཉིད་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (16) It is the pure and immaculate seal that is characterized by the realization of buddha qualities because it is pure in terms of former training.
